"""
算术运算符

Version: 1.0
Author: 骆昊
"""
print("--------算术运算符---------")
print(321 + 12)     # 加法运算，输出333
print(321 - 12)     # 减法运算，输出309
print(321 * 12)     # 乘法运算，输出3852
print(321 / 12)     # 除法运算，输出26.75
print(321 // 12)    # 整除运算，输出26
print(321 % 12)     # 求模运算，输出9
print(321 ** 12)    # 求幂运算，输出1196906950228928915420617322241
print(2 + 3 * 4)   # 运算符优先级，输出14
print((2 + 3) * 4) # 运算符优先级，输出20
print(2 ** 3 ** 2)   # 运算符优先级，输出512
print(2 ** (3 ** 2))   # 512 - 显式括号，结果相同
print((2 ** 3) ** 2)   # 64  - 如果从左向右计算的结果
print("--------算术运算符---------\n")




"""
算术运算的优先级

Version: 1.0
Author: 骆昊
"""
print("--------算术运算的优先级---------")
print(2 + 3 * 5)           # 17
print((2 + 3) * 5)         # 25
print((2 + 3) * 5 ** 2)    # 125
print(((2 + 3) * 5) ** 2)  # 625
print("--------算术运算的优先级---------\n")

